const CHOICE1 = "choice1";
const CHOICE2 = "choice2";
const CHOICE3 = "choice3";
const CHOICE4 = "choice4";

const testQuestions = [
  {
    id: 1,
    question: "Ви приймаєте важливі рішення, спираючись на...",
    [CHOICE1]: "Почуття та інтуїцію",
    [CHOICE2]: "Те, що краще звучить",
    [CHOICE3]: "Те, що краще виглядає та красивіше",
    [CHOICE4]: "Точне та педантичне вивчення всіх обставин та  перспектив",
    selected: null,
  },
  {
    id: 2,
    question: "Під час конфлікту з людиною на вас найсильніше впливає...",
    [CHOICE1]:
      "Наскільки ви у контакті з його почуттями, чи ділиться він своїми переживаннями",
    [CHOICE2]: "-",
    [CHOICE3]: "Чи можу я чи ні, ясно бачити точку зору іншої людини",
    [CHOICE4]: "Логіка його аргументації",
    selected: null,
  },
  {
    id: 3,
    question: "Ви найпростіше розумієте, що відбувається з вами, коли...",
    [CHOICE1]: "Ловіть свої відчуття",
    [CHOICE2]: "-",
    [CHOICE3]: "Дивіться на себе уважно в дзеркало та вирішуєте, що вдягнути",
    [CHOICE4]: "Висловлюєте це словами",
    selected: null,
  },
  {
    id: 4,
    question: "Для вас найпростіше...",
    [CHOICE1]: "Вибрати надзвичайно зручні меблі",
    [CHOICE2]: "Підібрати ідеальні гучність та звучання на стереосистемі",
    [CHOICE3]: "Підібрати ідеальні поєднання кольорів",
    [CHOICE4]:
      "Працювати з текстом, вибираючи найбільш вдалі місця, що належать до предмету, що вивчається",
    selected: null,
  },
  {
    id: 5,
    question: "Найкраще ви запам'ятовуєте...",
    [CHOICE1]: "Аромати та смак",
    [CHOICE2]: "Мелодії та звуки",
    [CHOICE3]: "Особи, кольори, картини",
    [CHOICE4]: "Логічні побудови",
    selected: null,
  },
  {
    id: 6,
    question: "Ви...",
    [CHOICE1]:
      "Дуже чутливі до того, як тканина, з якої пошитий ваш одяг, впливає на вашу шкіру",
    [CHOICE2]: "Налаштовуєтесь на звуки у своєму оточенні",
    [CHOICE3]: "Завжди звертаєте увагу на колір приміщення, в якому опиняєтеся",
    [CHOICE4]: "Добре вмієте осмислювати нові факти та дані",
    selected: null,
  },
];
